tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/0.orig/alpha.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    closedEnd
    {
        type            constantAlphaContactAngle;
        theta0          90;
        limit           gradient;
        value           uniform 0;
    }
    walls
    {
        type            constantAlphaContactAngle;
        theta0          90;
        limit           gradient;
        value           uniform 1;
    }
    riserWall
    {
        type            constantAlphaContactAngle;
        theta0          90;
        limit           gradient;
        value           uniform 1;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
}
