tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/0.orig/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    "(inlet|atmosphere)"
    {
        type            calculated;
        value           uniform 0;
    }
    "(closedEnd|walls|riserWall)"
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
}
