tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/0.orig/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e-6;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-6;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1e-6;
        value           uniform 1e-6;
    }
    "(closedEnd|walls|riserWall)"
    {
        type            kqRWallFunction;
        value           uniform 1e-6;
    }
}
