tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 107787.946;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 107787.946;
    }
    closedEnd
    {
        type            calculated;
        value           uniform 101325;
    }
    walls
    {
        type            calculated;
        value           uniform 107787.946;
    }
    riserWall
    {
        type            calculated;
        value           uniform 107787.946;
    }
    atmosphere
    {
        type            calculated;
        value           uniform 101325;
    }
}
