tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

phases          (water air);
pMin            50000;

sigma
{
    type        constant;
    sigma       0.072;
}
