tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/constant/thermophysicalProperties.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectFluid;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.01528;
    }
    equationOfState
    {
        // rho0*R is approximately the physical 2.2 GPa water bulk modulus.
        R           2.2044e6;
        rho0        998;
    }
    thermodynamics
    {
        Cp          4182;
        Hf          0;
    }
    transport
    {
        mu          9.33e-4;
        Pr          7.0;
    }
}
