tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Chan, Cong & Lee (2018) used the standard k-epsilon closure.
simulationType RAS;

RAS
{
    RASModel        kEpsilon;
    turbulence      on;
    printCoeffs     on;
}
