tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 4;
method scotch;
