tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss linear;

    div(rhoPhi,U)   Gauss linearUpwind grad(U);
    div(rhoPhi,T)   Gauss upwind;
    div(rhoPhi,K)   Gauss upwind;
    div(rhoPhi,k)   Gauss upwind;
    div(rhoPhi,epsilon) Gauss upwind;
    div(phi,p)      Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

fluxRequired
{
    default         no;
    p_rgh;
    alpha.water;
}
