tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    walls.stl      { type triSurfaceMesh; name walls; }
    riserWall.stl  { type triSurfaceMesh; name riserWall; }
    inlet.stl      { type triSurfaceMesh; name inlet; }
    closedEnd.stl  { type triSurfaceMesh; name closedEnd; }
    atmosphere.stl { type triSurfaceMesh; name atmosphere; }

    teeRefine
    {
        type searchableBox;
        min (3.39 -0.04 -0.005);
        max (3.55  0.04  0.12);
    }
    valveRefine
    {
        type searchableBox;
        min (5.92 -0.03 -0.005);
        max (6.04  0.03  0.055);
    }
    riserRefine
    {
        type searchableCylinder;
        point1 (3.47 0 0.045);
        point2 (3.47 0 1.85);
        radius 0.016;
    }
    plumeRefine
    {
        type searchableBox;
        min (3.42 -0.05 1.84);
        max (3.52  0.05 2.20);
    }
}

castellatedMeshControls
{
    maxLocalCells       1500000;
    maxGlobalCells      4000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 2;

    features ();

    refinementSurfaces
    {
        walls
        {
            level (1 1);
            patchInfo { type wall; }
        }
        riserWall
        {
            level (1 1);
            patchInfo { type wall; }
        }
        inlet
        {
            level (1 1);
            patchInfo { type patch; }
        }
        closedEnd
        {
            level (1 1);
            patchInfo { type wall; }
        }
        atmosphere
        {
            level (0 0);
            patchInfo { type patch; }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        teeRefine   { mode inside; levels ((1e15 1)); }
        valveRefine { mode inside; levels ((1e15 1)); }
        riserRefine { mode inside; levels ((1e15 1)); }
        plumeRefine { mode inside; levels ((1e15 1)); }
    }

    locationInMesh (1.0 0 0.025);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch             5;
    tolerance                2.0;
    nSolveIter               100;
    nRelaxIter               8;
    nFeatureSnapIter         10;
    implicitFeatureSnap      true;
    explicitFeatureSnap      false;
    multiRegionFeatureSnap   false;
}

addLayersControls
{
    relativeSizes false;
    layers
    {
        riserWall
        {
            nSurfaceLayers 2;
        }
    }
    thickness                   0.0012;
    firstLayerThickness         0.0004;
    minThickness                0.00015;
    nGrow                       0;
    featureAngle                70;
    slipFeatureAngle            30;
    nRelaxIter                  5;
    nSmoothSurfaceNormals       3;
    nSmoothNormals              5;
    nSmoothThickness            10;
    maxFaceThicknessRatio       0.5;
    maxThicknessToMedialRatio   0.3;
    minMedialAxisAngle          90;
    nBufferCellsNoExtrude       0;
    nLayerIter                  80;
}

meshQualityControls
{
    maxNonOrtho             65;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minVol                  1e-15;
    minTetQuality           1e-15;
    minArea                 -1;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.05;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    nSmoothScale            4;
    errorReduction          0.75;
}

writeFlags (layerSets layerFields);
mergeTolerance 1e-7;
