tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/3d/system/topoSetDict.valve
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    valveZone;
        type    faceZoneSet;
        action  new;
        source  planeToFaceZone;
        point   (5.98 0 0.025);
        normal  (1 0 0);
    }
    {
        name    valveFaces;
        type    faceSet;
        action  new;
        source  zoneToFace;
        zone    valveZone;
    }
    {
        name    valveFaces;
        type    faceSet;
        action  subset;
        source  boxToFace;
        box     (5.94 -0.03 -0.005) (6.02 0.03 0.055);
    }
    {
        name    upstreamCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1 -1 -1) (5.98 1 3.1);
    }
    {
        name    valveZone;
        type    faceZoneSet;
        action  new;
        source  setsToFaceZone;
        faceSet valveFaces;
        cellSet upstreamCells;
    }
);
